trunk/Application/marktroibags3.0/frontend/controllers/OrderController.php

INSERT INTO `order` (`user_id`, `username`, `product_id`, `qty`, `specification`, `shippingaddress`, `date`) VALUES (5, 'admin', 6, '10,000', 'nothing really', '3 Humabon St Magallanes Makati City', '03-30-2015')
---
    public function actionCreate()
    {
        $model = new Order();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `order` WHERE `id`='14'
---
    protected function findModel($id)
    {
        if (($model = Order::findOne($id)) !== null) {