trunk/Application/marktroibags3.0/frontend/controllers/ProductController.php

    protected function findModel($id)
    {
        if (($model = Product::findOne($id)) !== null) {
---
SELECT * FROM `product` WHERE `id`='4'