trunk/Application/marktroibags3.0/backend/controllers/ProductController.php

    public function actionCreate()
    {
        $model = new Product();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `product` (`user_id`, `username`, `name`, `description`) VALUES (1, 'marktroibags-admin', 'Clutch Bag', 'A small flat bag without a handle, carried by women, especially on formal occasions. Designed to hold a few necessities like a driver\'s license, a cellphone, and a credit card.')

    protected function findModel($id)
    {
        if (($model = Product::findOne($id)) !== null) {
---
SELECT * FROM `product` WHERE `id`='11'