trunk/Application/marktroibags3.0/backend/controllers/ReportController.php

SELECT * FROM `report` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Report::findOne($id)) !== null) {