trunk/Application/marktroibags3.0/frontend/views/Order/_form.php


    <?= $form->field($model, 'username')->textInput(['value'=>Yii::$app->user->identity->username]) ?>

    <?= $form->field($model, 'product_id')->dropDownlist(
        ArrayHelper::map(product::find()->all(),'id','name'),
        ['prompt'=>'Select product']
     )?>
---
SELECT * FROM `user`