trunk/Application/mtbags/frontend/views/Order/_form.php

SELECT * FROM `product`
---


    <?php
        $products=Product::find()->all();