trunk/Application/mtbags/backend/models/Order.php

    public static function getUsername(){
        $UsernameID=User::find()->all();
---
SELECT * FROM `user`

        public static function getProductName(){
        $products=Product::find()->all();
---
SELECT * FROM `product`