trunk/Application/mtbags/frontend/models/SignupForm.php

INSERT INTO `user` (`fname`, `lname`, `contact_no`, `username`, `email`, `password_hash`, `company_name`, `company_description`, `shipping_address`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('Dan', 'Gahallon', '09272016871', 'dygahallon', 'dygahallon@gmail.com', '$2y$13$hhbnxr4DkXt8SJGf62FkMOigTBLkWsnre85U4YyZrWyL7fFV6v1Lq', 'Midara', NULL, 'Putatan, Muntinlupa City', 'AyDGA22M2fSbaqGi5bw1oKSHETWFyEgO', 10, 1426362215, 1426362215)
---
    public function signup()
    {
        if ($this->validate()) {
            $user = new User();
			$user->fname = $this->fname;
			$user->lname = $this->lname;
			$user->contact_no = $this->contact_no;
            $user->username = $this->username;
            $user->email = $this->email;
            $user->setPassword($this->password);
			$user->company_name = $this->company_name;
			$user->company_description = $this->company_description;
			$user->shipping_address = $this->shipping_address;
            $user->generateAuthKey();
            if ($user->save()) {